package Task3;

public class Main {
    //Да се направи аналогия между ООП полиморфизъм и:
    //а) музика
    //б) спорт

    //    В музиката може да имеме метод изпълни песен (play song), но действието ще е различно в зависимост от
    //    инструмента на който се изпълнява. При китарата ще имаме едно действие и звучене, при барабаните друго, а при
    //    вокала трето.
    //
    //
    //    В спорта може да имаме метод - играй, но действието ще бъде различно при различните спортове:
    //    - При баскетбола Баскетбола топане на топката;
    //    - При футбола - ритане на топката;
    //
    //    Друг пример може да е метод "отбелязване на точка" (scoreAGoal), където:
    //    - При баскетоба - топката влиза в коша/мрежата;
    //    - При футбола - топката влиза във вратата;
}
