package Task4;
public class Main {
    //Направете поне 2 различни аналогии с понятието
    //интерфейс в контекста на спорта
    //Направете поне 2 различни аналогии с понятието
    //абстрактен клас в контекста на търговията
    public static void main(String[] args) {
        System.out.println("Като метод в интерфейс в контекста на спорта може да имаме " +
                "ScoreGoal, ChangePlayerNumber, printTeam или нещо подобно, което всеки един " +
                "спорт задължително има");
        System.out.println("Абстрактен метод в търговията би бил - метод 'Продава', 'Купува', " +
                "'Зарежда',а това би се емплиментирало различно в зависимост от стоките които се продават.");
    }
}
