public class Task1 {
    //Направете клас Monument (статуя), който има полета: name, height,
    //material и flowersAmount. Метод clearMonument() - отпечатва текст, че
    //сме почистили статуята. И метод putFlower(String flowerType), при
    //който увеличаваме полето flowersAmount с 1. Паметниците имат
    //лимит от 30 цветя и а ако станат повече от 30 отпечатваме
    //съобщение, че няма място и НЕ добавяме ново цвете.
    //Добавете и метод printInfo(), който отпечатва информация с всички
    //полета на класа.
    //Класът трябва да има 2 конструктора: без параметри и с параметри.
    //Създайте 2 обекта на класа и експериментирайте с всички методи на
    //класа.

}
