def get_yn_stadium_lights() -> bool:
    ans = input("Има ли осветление[y/n]? ")
    if ans.lower() == 'y':
        return True
    elif ans.lower() == 'n':
        return False
    else:
        print("Грешен отговор! Моля отговорете с 'y' или 'n'.")
        return get_yn_stadium_lights()


def task_1():
    """
     За даден стадион имаме следните характеристики:
    ▪ Наименование на стадиона
    ▪ Капацитет в бр. седящи места (в променливата capacity) ▪ Дали има осветление (в променливата hasLights)
    ▪ Площ в квадратни метри (дробно число)
    Напишете програма, която позволява на потребителя да въведе характеристики за стадион и
     след това ги отпечатва в подходящ вид. Стремете се да имате добро потребителско
     изживяване (да е ясно какво се очаква от потребителя).
    """
    stadium_name = input("Въведете името на стадиона: ")
    capacity = input("Какъв е капацитетът му? ")
    area_sqm = input("Каква е площа на стадион " + stadium_name + " в квадратни метри?")
    has_lights = get_yn_stadium_lights()

    print(f"Стадион: {stadium_name}")
    print(f"Капацитет: {capacity}")
    print(f"Площ: {area_sqm}")
    if has_lights:
        print("Осветление: Да")
    else:
        print("Осветление: Не")


def task_2():
    """
    Да се напише програма, която позволява на потребителя да въведе цяло число N и
    след това отпечатва цяла част и остатък при деление на N с 3.
    """
    N = int(input("Въведете число: "))
    result_part_1 = int(N / 3)
    result_part_2 = N % 3
    print(f"При делене на 3 има {result_part_1} цели части и остатък от {result_part_2}.")


def task_3():
    """
     За даден автомобил са дадени следните характеристики:
     ▪ Възраст в години (age)
     ▪ Цена в хил.лв. (price)
    Един автомобил е от висок клас, ако е по-стар от 5 години и струва над 20 хил.лв. или е
     на 5 или по-малко години и струва над 40 хил.лв.
    Прочетете двете стойности от конзолата.
    Напишете израз, който определя дали автомобил с дадени характеристики е от висок клас.
    Принтирайте резултатът от израза (true или false).
    """
    age = int(input("На колко години е автомобилът? "))
    price = int(input("Колко пари струва (хил. лв)? "))

    high_class = (age > 5 and price > 20000) or (age <=5 and price > 40000)
    if high_class:
        print("Автомобилът е висок клас.")
    else:
        print("Автомобилът е нисък клас.")


def task_4():
    """
     Напишете израз, който намира и извежда в конзолата абсолютната стойност на дадено цяло число.
     Абсолютната стойност на едно число Х е разстоянието му до 0.
     Пример:
     ако x = 5, то абсолютната стойност е 5 ако х = -23, то абсолютната стойност е 23
     Прочетете числото от конзолата.
    """
    N = float(input("Въведете число: "))
    if N % 1 == 0:
        print(f'Абсолютната стойност на "{int(N)}" е: {abs(int(N))}')
    else:
        print(f'Абсолютната стойност на "{N}" е: {abs(N)}')


def task_5():
    """
    Напишете булев израз, който да проверява дали едно цяло число въведено от потребител
    се дели на 3 и на 7 без остатък.
    """
    N = int(input("Въведете число: "))
    to_print = f"Числото {N} се дели без остатък на "

    is_divisible_by_3 = N % 3 == 0
    is_divisible_by_7 = N % 7 == 0

    if is_divisible_by_3 and is_divisible_by_7:
        to_print += "3 и на 7."
    elif is_divisible_by_3:
        to_print += "3, но не и на 7."
    elif is_divisible_by_7:
        to_print += "7, но не и на 3."
    else:
        to_print = f"Числото {N} не се дели без остатък нито на 3, нито на 7."

    print(to_print)


if __name__ == '__main__':
    # task_1()
    # task_2()
    # task_3()
    # task_4()
    task_5()