package Task3;
public class Main {
    //Да се направи абстрактен клас ElectronicDevice с полета: марка, цена и мощност
    //(в kW - киловата). И реален метод: plugIntoElectricity(). Както и абстрактен метод:
    //turnOn()
    //● Да се направи клас AirConditioner, който наследява ElectronicDevice и има методи:
    //heat(int hours) и cool(int hours) - колко часа да затопля или охлажда. И двата
    //метода връщат като резултат изразходвана енергия - в киловат часа. Да се
    //предефинира toString().
    //● Да се направи клас Oven, който наследява ElectronicDevice и има поле stoveCount
    //- брой котлони. Както и методи: cookInOven(int hours, String dish) - готвене на ястие
    //във фурната, cookOnStove(int hours, Sring dish) - готвене на ястие на котлон. И
    //двата метода връщат като резултат изразходвана енергия - в киловат часа. Да се
    //предефинира toString().
    //● Измислете какъв интерфейс / какви интерфейси е смислено да се направи и
    //го/ги добавете?
    //● Да се направи масив с 4 ел. уреда и да се експериментира с техните методи.
    public static void main(String[] args) {
        //todo
    }

}
