package Task1;

public class Main {
    //Напишете класове, които представят работа с библиотека. Библиотеката има
    //име, адрес и работно време (текстови полета).
    //Библиотеката има и списък с издания, които могат да бъдат наемани.
    //Изданията може да бъдат книги или вестници.
    //Книгите имат име, автор, година на издаване.
    //Вестниците имат име и дата на издаване.
    //За книга или вестник може да се отбелязва дали са свободни налични в
    //библиотеката.
    //Изданията (класът, който описва изданията) имат следните методи:
    //- book(), който отбелязва изданието като заето (т.е. не е налично в
    //библиотеката)
    //- returnToLibrary(), който го отбелязва като свободно
    //- getDetails() връща информация за изданието (име и автор за книгите; име
    //и дата за вестниците).
    public static void main(String[] args) {

    }
}
