package Task4;

public class Main {
    public static void main(String[] args) {
        //Измислете пример за поне 1 статично поле и 1 статичен метод в контекста на
        //новинарско предаване по телевизията. Пояснете с по 1 изречение какво
        //точно е предназначението на полето и метода.

        Статични полета могат да бъдат:
        - Фиксирано време за Новините/ реклама / спортните новини и т.н.;
        - Емблемата/знака на телевизията; // бТВ, Нова ..

        Статичен метод:
        - Пускане на анимацията с която започват новините;
        - Пускане на финалните надписи - облекло и т.н.;
        - Затъмняване на екрана / преливане - преди пускане на репортаж;
        - Смяна на камерата от един водещ на друг;
    }
}
