package Task1;

public class Main {
    //Като работите по произволен github проект, различен
    //от финалните проекти за Ниво 1 и Ниво 2 -
    //предизвикайте и разрешете merge conflict.
    //Подсказка: Създайте 2 бранча от main и променете
    //един и същ файл в двата бранча. След като merge-нете
    //първият бранч ще имате конфликт при опит за mergeнете втория.

    public static void main(String[] args) {
        // Създай бранч и направи нов клас "Car". Нека да има полета:
        // - brand, age и color. Аз ще направя същото във друг бранч.
        // Добави нещо допълнително по твой избор. Аз ще добавя също.
        // После ще мерджнем и ще решим проблема.

    }

    public static void sayHello(String name) {
        System.out.println("Hello " + name);
    }
}
